<a href="https://colab.research.google.com/github/Di-Esme/PIS/blob/main/3_03_2021.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Exploratory data analisis**

Разветочный (исследовательский) анализ данных

# import packeges

In [2]:
import pandas as pd
import numpy as np
from IPython.display import display

# import data

In [3]:
data = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data",
                   header = None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [8]:
names = ["Id", "RI", "Na", "Mg", "Al", "Si", "K", "Ca", "Ba", "Fe", "Class"]
data.columns = names
data = data.drop(columns=['Id'])
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [10]:
data['Class'].replace({1:"building_float", 
                       2:"building_non_float", 
                       3:"vehicle_float",
                       4:"vehicle_non_float",
                       5:"containers",
                       6:"tableware",
                       7:"headlamps"}, inplace=True)
data['Class'].value_counts()

building_non_float    76
building_float        70
headlamps             29
vehicle_float         17
containers            13
tableware              9
Name: Class, dtype: int64

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      214 non-null    float64
 1   Na      214 non-null    float64
 2   Mg      214 non-null    float64
 3   Al      214 non-null    float64
 4   Si      214 non-null    float64
 5   K       214 non-null    float64
 6   Ca      214 non-null    float64
 7   Ba      214 non-null    float64
 8   Fe      214 non-null    float64
 9   Class   214 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [12]:
 for col in data.columns:
      fr = np.random.randint(5,10)/100
      data.loc[data.sample(frac=fr).index, col] = np.nan

#**Data Visualization**

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      195 non-null    float64
 1   Na      197 non-null    float64
 2   Mg      201 non-null    float64
 3   Al      201 non-null    float64
 4   Si      203 non-null    float64
 5   K       201 non-null    float64
 6   Ca      201 non-null    float64
 7   Ba      195 non-null    float64
 8   Fe      201 non-null    float64
 9   Class   199 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [16]:
data.describe()

               RI          Na          Mg  ...          Ca          Ba          Fe
count  195.000000  197.000000  201.000000  ...  201.000000  195.000000  201.000000
mean     1.518344   13.396751    2.677214  ...    8.939353    0.161641    0.056418
std      0.003102    0.820056    1.452380  ...    1.415128    0.475762    0.095127
min      1.511150   10.730000    0.000000  ...    5.430000    0.000000    0.000000
25%      1.516515   12.930000    1.880000  ...    8.240000    0.000000    0.000000
50%      1.517680   13.300000    3.480000  ...    8.600000    0.000000    0.000000
75%      1.519155   13.810000    3.600000  ...    9.140000    0.000000    0.100000
max      1.533930   17.380000    4.490000  ...   16.190000    3.150000    0.510000

[8 rows x 9 columns]

In [19]:
print('_______________________')
display(data['Class'].describe())
print('_______________________')
display(data['Class'].value_counts())

_______________________

count                    199
unique                     6
top       building_non_float
freq                      71
Name: Class, dtype: object

_______________________

building_non_float    71
building_float        66
headlamps             28
vehicle_float         16
containers            10
tableware              8
Name: Class, dtype: int64